<?php

	function SpecialRegex()
	{
		return "¤¶§††`|~ÇüéâäàåçêëèïîìæÆôöòûùÿ¢£¥PƒáíóúñÑ‡‡¿¬½¼¡«»¦ßµ±°•·²€„…†‡ˆ‰Š‹Œ‘’“”–—˜™š›œŸ¨©®¯³´¸¹¾ÀÁÂÃÄÅÈÉÊËÌÍÎÏÐÒÓÔÕÖ×ØÙÚÛÜÝÞãðõøüýþ";
	}
	
	function TextRegex()
	{
		return ".a-zA-Z0-9‘\s\,\.\?\"\'\:\;\[\]\{\}\-\_\=\+\(\)\!\@\#\$\%\^\&\*\\/\s\|".SpecialRegex();
	}
	
	function AllRegex()
	{
		return ".a-zA-Z0-9‘\s\,\.\?\"\'\:\;\[\]\{\}\-\_\=\+\(\)\!\@\#\$\%\^\&\*\\/\s\<\>\|".SpecialRegex();
	}	
	
	function LinkRegex()
	{
		return "0-9a-zA-Z$-_.+!*'()$&,\/:;=?@\"\<\>\#\%\{\}\|\\\^\~\[\]\`";
	}
	
	//IF YOU CANT USE SPECIAL/TEXT/ALL REGEX AND NEED TO DO A PREG SEARCH
	//function fixRegex($string)
	//{	 
		//still bug with \\ staying as \
		//return preg_replace(array("/\,/","/\./","/\?/","/\"/","/\'/","/\:/","/\;/","/\[/","/\]/","/\{/","/\}/","/\-/","/\_/","/\=/","/\+/","/\(/","/\)/","/\!/","/\@/","/\#/","/\$/","/\%/","/\^/","/\&/","/\*/","/\</","/\>/","/\|/","/\//",'/\\\/'),array("\,","\.","\?","\"","\'","\:","\;","\[","\]","\{","\}","\-","\_","\=","\+","\(","\)","\!","\@","\#","\$","\%","\^","\&","\*","\<","\>","\|","\/","\\\\\\"), $string);
	//}
?>